from 강의용도구 import 강의준비하다, 말하다, 화면출력하다, 멈추고_계속진행여부_묻고_튜토리얼

강의준비하다(__file__)

# 제 수업 컨셉은 lecture in code 입니다.

화면출력하다("================= 강사 소개 및 인사 ================= ")
말하다(f"안녕하세요 7년차 개발자 박정훈입니다.")
말하다(f"일반인들을 위한 프로그래밍 수업에 오신걸 환영해요.")
말하다(f"제 목표는 수강생분들이 AI 에게 질의하여 피드백을 얻고 프로그램에 적용하여 윈도우 기반의 업무를 자동화 할 수 있도록 돕는 것입니다")
말하다(f"거두절미하고, 강의를 바로 시작합니다.")
말하다("이 수업은 복붙/실행/결과비교 의 순서로 수업은 진행이 됩니다, 꼭 기억하세요 복붙/실행/결과비교")
말하다("다시한번 말씀드립니다. 복붙/실행/결과비교")
멈추고_계속진행여부_묻고_튜토리얼()

# 나의_잠자기_튜토리얼_설명하기() 함수


말하다(f"개발환경을 만들기")  # pycharm IDE 무료기능 사용.  inspection 기능으로 학습효율 극대화
멈추고_계속진행여부_묻고_튜토리얼()




말하다(f"흐름제어")  # 주석
'''
    이곳이 어떤것을 작성하여도 프로그램에 영향을 주지않아요.
'''



말하다(f"흐름끊기")  # 주석
멈추고_계속진행여부_묻고_튜토리얼()

말하다(f"직선흐름")  # print  psutil
멈추고_계속진행여부_묻고_튜토리얼()

말하다(f"둥근흐름")  # for / while # loop 문
멈추고_계속진행여부_묻고_튜토리얼()

말하다(f"흐름들")
멈추고_계속진행여부_묻고_튜토리얼()

말하다(f"프로그램 흐름 예측해보기")
멈추고_계속진행여부_묻고_튜토리얼()

말하다(f"프로그램 의도 파악하여 복붙해보기")
멈추고_계속진행여부_묻고_튜토리얼()

말하다(f"프로그램 흐름 복붙하여 실험해보기")
멈추고_계속진행여부_묻고_튜토리얼()

말하다(f"프로그램 흐름 실험해보기")
멈추고_계속진행여부_묻고_튜토리얼()

말하다(f"프로그램 흐름 실험결과 비교")  # 로깅

말하다(f"일반인들을 위한 강의 시작합니다.")

말하다("프로그램 만들기")  # 학습자의 컴퓨터 자동화 튜토리얼 만르기
멈추고_계속진행여부_묻고_튜토리얼()

화면출력하다("================= 강사 끝인사 ================= ")
말하다(f"cli 인터페이스.")
말하다(f"업무자동화.")
화면출력하다(f"수업도 cli기반 자동화로 만들었습니다 ㅎㅎ")
말하다(f"제 수업은 귀납적인 탑다운 방식의 수업입니다. 실험/결과비교 순으로 진행이 됩니다.")

말하다(f"수업도 cli기반 자동화로 만들었습니다 하하")



# 영어로 작성을 연습해야해요.
# 영어로 작성을 하면되요.


# TODO :  ver_cpp  ver_arduino 도 필요
# 프로그램 흐름 만들기
# for idx, _ in enumerate([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]):
#     print()

# minutes = ensure_value_completed_2025_10_12_0000(key_hint='minutes=', values=[1, 3, 5])

# +
# 핫리로더 사용해보도록, 핫리로더 주의사항.
# 일단 복잡해 보이는것은 모두 숨겨야함.









# # ide
# 개발자는 코드 생산성을 위해서 툴을 잘써야한다.
# 코드생산성=코드생산량/시간
#
# pk_* -> 
# *VSCODE CODE SNIPPETS
# *PYCHARM live template
# *PYCHARM inspection


# answer = ensure_value_completed_2025_10_12_0000(key_hint='answer(o/x)=', values=['o', 'x'])